docs/arch/Archlist.html
<!doctype html>
<html lang="en">
<head>
<title>Architettura degli elaboratori</title>
<!-- 2022-01-14 Fri 21:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jacopo Costantini &amp; Matteo Zambon">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Introduzione</a></li>
<li><a href="#sec-2">2. Rappresentazione dell&rsquo;informazione</a></li>
<li><a href="#sec-3">3. Algebra di Bool</a></li>
<li><a href="#sec-4">4. Circuiti combinatori</a></li>
<li><a href="#sec-5">5. Linguaggio macchina e assembler MIPS</a></li>
<li><a href="#sec-6">6. Circuiti combinatori: ALU</a></li>
<li><a href="#sec-7">7. Moltiplicazione e divisione tra numeri interi: algoritmi e circuiti</a></li>
<li><a href="#sec-8">8. Memorie e circuiti sequenziali</a></li>
<li><a href="#sec-9">9. Progetto CPU a singolo ciclo</a></li>
<li><a href="#sec-10">10. Progetto CPU a multiciclo</a></li>
<li><a href="#sec-11">11. Valutazione prestazioni e legge di Amdahl</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Architettura degli elaboratori</h1>
<p>
Indice degli argomenti
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="introduzione.html">Introduzione</a></h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="numbers.html">Rappresentazione dell&rsquo;informazione</a></h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="bool.html">Algebra di Bool</a></h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="circuiti.html">Circuiti combinatori</a></h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="isamips.html">Linguaggio macchina e assembler MIPS</a></h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="alu.html">Circuiti combinatori: ALU</a></h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="mult.html">Moltiplicazione e divisione tra numeri interi: algoritmi e circuiti</a></h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="sequenziali.html">Memorie e circuiti sequenziali</a></h2>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="cpusingleclock.html">Progetto CPU a singolo ciclo</a></h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="cpumulticlock.html">Progetto CPU a multiciclo</a></h2>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="valprest.html">Valutazione prestazioni e legge di Amdahl</a></h2>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Jacopo Costantini &amp; Matteo Zambon</p>
<p class="date">Created: 2022-01-14 Fri 21:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
